## [debugtest](https://daniellem97.app.spacelift.io/stack/debugtest/run/01JWEQMRJEK34TGM9V9F3422EY) plan logs

<details>
<summary>Click here to expand</summary>

```
[01JV7FBMZS94V7V7JD7G28V27B] Planning changes with 0 custom hooks...
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c spacelift-worker env >> /mnt/workspace/.env_hooks_before && tofu plan -input=false -lock=false -out=spacelift.plan && spacelift-worker env >> /mnt/workspace/.env_hooks_after]
data.terraform_remote_state.demo-stack-state: Reading...
data.terraform_remote_state.demo-stack-state: Read complete after 0s
data.aws_ami.server_ami: Reading...
aws_vpc.mtc_vpc: Refreshing state... [id=vpc-0c3261a70311f6cae]
data.aws_ami.server_ami: Read complete after 0s [id=ami-09563a10670fc573c]
aws_route_table.mtc_public_rt: Refreshing state... [id=rtb-0efdeb51db503c285]
aws_subnet.mtc_public_subnet: Refreshing state... [id=subnet-05a55ca6b47ed5494]
aws_internet_gateway.mtc_internet_gateway: Refreshing state... [id=igw-03131412a64293059]
aws_security_group.mtc_sg: Refreshing state... [id=sg-082069860a02ef64a]
aws_route.default_route2: Refreshing state... [id=r-rtb-0efdeb51db503c2851080289494]
aws_route.default_route: Refreshing state... [id=r-rtb-0efdeb51db503c2851080289494]
aws_route_table_association.mtc_public_assoc: Refreshing state... [id=rtbassoc-087dc9abf587278d1]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_kms_key.cmk will be created
  + resource "aws_kms_key" "cmk" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "CMK for S3 encryption policy test"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = *****
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # aws_s3_bucket.bad_bucket_key will be created
  + resource "aws_s3_bucket" "bad_bucket_key" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "spacelift-teamalpha-nobucketkey"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = "aws:kms"
                }
            }
        }

      + versioning (known after apply)
    }

  # aws_s3_bucket.bad_kms_key will be created
  + resource "aws_s3_bucket" "bad_kms_key" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "spacelift-teamalpha-badkms"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = *****

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = "alias/aws/s3"
                  + sse_algorithm     = "aws:kms"
                }
            }
        }

      + versioning (known after apply)
    }

  # aws_s3_bucket.bad_public will be created
  + resource "aws_s3_bucket" "bad_public" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "public-bad-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Purpose" = "policy-bad"
        }
      + tags_all                    = {
          + "Purpose" = "policy-bad"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning (known after apply)
    }

  # aws_s3_bucket.good_bucket will be created
  + resource "aws_s3_bucket" "good_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "spacelift-teamalpha-good"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Purpose" = "policy-good"
        }
      + tags_all                    = {
          + "Purpose" = "policy-good"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = *****

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = "aws:kms"
                }
            }
        }

      + versioning (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

[01JV7FBMZS94V7V7JD7G28V27B] Changes are GO
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c tofu show -json]
[01JV7FBMZS94V7V7JD7G28V27B] Uploading the list of managed resources...
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c tofu show -json "spacelift.plan"]
[01JV7FBMZS94V7V7JD7G28V27B] Generating Infracost JSON report from plan
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c INFRACOST_SKIP_UPDATE_CHECK=true infracost breakdown --path /tmp/spacelift-plan1858290204 --format=json --log-level=warn]

[01JV7FBMZS94V7V7JD7G28V27B] Infracost report generated successfully
[01JV7FBMZS94V7V7JD7G28V27B] Mapping Infracost data to resources
[01JV7FBMZS94V7V7JD7G28V27B] Costs mapped successfully
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c tofu output -json]
[01JV7FBMZS94V7V7JD7G28V27B] Please be aware that the run changes calculation includes output changes.
[01JV7FBMZS94V7V7JD7G28V27B] Resource list upload is GO
[01JV7FBMZS94V7V7JD7G28V27B] Generating JSON representation of the plan...
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c tofu show -json "spacelift.plan"]
[01JV7FBMZS94V7V7JD7G28V27B] JSON representation is GO
[01JV7FBMZS94V7V7JD7G28V27B] Generating Infracost JSON report from plan
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c INFRACOST_SKIP_UPDATE_CHECK=true infracost breakdown --path spacelift.plan.json --format=json --log-level=warn]

[01JV7FBMZS94V7V7JD7G28V27B] Infracost report generated successfully
[01JV7FBMZS94V7V7JD7G28V27B] Loading custom plan policy inputs...
[01JV7FBMZS94V7V7JD7G28V27B] 0 custom plan policy inputs found
[01JV7FBMZS94V7V7JD7G28V27B] Evaluated 1 plan policy
[01JV7FBMZS94V7V7JD7G28V27B] Denied by policy: S3 bucket name "public-bad-bucket" must start with the "spacelift-{team-name}" prefix.
[01JV7FBMZS94V7V7JD7G28V27B] Denied by policy: S3 bucket public-bad-bucket uses disallowed ACL "public-read" – buckets must not be public.
[01JV7FBMZS94V7V7JD7G28V27B] Failing the run as per plan policy
```

</details>